# 05 Membalik urutan baris dan kolom pada data frame


## Import modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan data frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  9  1  2  6
1  2  6  7  2  5
2  8  4  9  2  2
3  6  3  8  1  4
4  8  8  3  6  9

## Membalik urutan kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  6  2  1  9  5
1  5  2  7  6  2
2  2  2  9  4  8
3  4  1  8  3  6
4  9  6  3  8  8

## Membalik urutan baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  8  8  3  6  9
3  6  3  8  1  4
2  8  4  9  2  2
1  2  6  7  2  5
0  5  9  1  2  6

## Membalik urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  8  8  3  6  9
1  6  3  8  1  4
2  8  4  9  2  2
3  2  6  7  2  5
4  5  9  1  2  6